app/controllers/api/v1/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "write an api"], ["description", "APIs are good for mobile dev"], ["created_at", "2018-01-07 03:24:06.653983"], ["updated_at", "2018-01-07 03:24:06.653983"]]