app/controllers/posts_controller.rb

  def index
   @posts = Post.paginate(:page => params[:page]).order(created_at: :desc)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Do stuff."], ["description", "A description."], ["created_at", "2017-08-26 21:49:42.419472"], ["updated_at", "2017-08-26 21:49:42.419472"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "share my story with others"], ["description", "Sharing is caring. Caring is sharing. Keep on sharing these stories please."], ["updated_at", "2017-08-27 18:25:57.305699"], ["id", 3]]