app/controllers/static_pages_controller.rb

    def admin
        @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC