app/controllers/static_pages_controller.rb

    def home
        @posts = Post.paginate(:page => params[:page]).order(created_at: :desc)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"